
const BASE_URL = "http://www.tsetmc.com/";
const SYMBOLS_LIST = "Loader.aspx?ParTree=111C1417";
const START_INDEX = 0;
const URL_LIMIT = 10;
const TIMEFRAMES = {
  m1:"m1", m5:"m5", m10:"m10", m30:"m30",
  h1:"h1", h4:"h4", d1:"d1"
};
const GROUPS = {
  "مخابرات":"64",
  "مواد و محصولات دارويي":"43",
  "استخراج زغال سنگ":"10",
  "ابزارپزشكي، اپتيكي و اندازه‌گيري":"33",
  "ساخت دستگاه‌ها و وسايل ارتباطي":"32",
  "بانكها و موسسات اعتباري":"57",
  "هتل و رستوران":"55",
  "خدمات فني و مهندسي":"74",
  "ساخت محصولات فلزي":"28",
  "محصولات شيميايي":"44",
  "استخراج نفت گاز و خدمات جنبي جز اكتشاف":"11",
  "انبوه سازي، املاك و مستغلات":"70",
  "حمل ونقل، انبارداري و ارتباطات":"60",
  "محصولات كاغذي":"21",
  "پيمانكاري صنعتي":"45",
  "محصولات چوبي":"20",
  "سيمان، آهك و گچ":"53",
  "فراورده هاي نفتي، كك و سوخت هسته اي":"23",
  "ساير محصولات كاني غيرفلزي":"54",
  "محصولات غذايي و آشاميدني به جز قند و شكر":"42",
  "قند و شكر":"38",
  "زراعت و خدمات وابسته":"01",
  "عرضه برق، گاز، بخاروآب گرم":"40",
  "دباغي، پرداخت چرم و ساخت انواع پاپوش":"19",
  "سرمايه گذاريها":"56",
  "اطلاعات و ارتباطات":"73",
  "شركتهاي چند رشته اي صنعتي":"39",
  "فلزات اساسي":"27",
  "استخراج كانه هاي فلزي":"13",
  "منسوجات":"17",
  "ساير واسطه گريهاي مالي":"58",
  "خرده فروشي،باستثناي وسايل نقليه موتوري":"47",
  "فعاليتهاي كمكي به نهادهاي مالي واسط":"67",
  "كاشي و سراميك":"49",
  "بيمه وصندوق بازنشستگي به جزتامين اجتماعي":"66",
  "حمل و نقل آبي":"61",
  "انتشار، چاپ و تكثير":"22",
  "ماشين آلات و تجهيزات":"29",
  "خودرو و ساخت قطعات":"34",
  "ماشين آلات و دستگاه‌هاي برقي":"31",
  "استخراج ساير معادن":"14",
  "رايانه و فعاليت‌هاي وابسته به آن":"72",
  "واسطه‌گري‌هاي مالي و پولي":"65",
  "لاستيك و پلاستيك":"25"
}
const TICKER = (code, group) => {
  return BASE_URL + "tsev2/data/instinfodata.aspx?i=" + code + "&c=" + group;
}

module.exports = {
  BASE_URL, SYMBOLS_LIST, TICKER,
  TIMEFRAMES, GROUPS, URL_LIMIT, START_INDEX
}